In [12]:
import dask.dataframe as dd

import pandas as pd

In [37]:
ddf = dd.read_json("people1.json", orient="split")

In [38]:
ddf.compute()

    name  age    car
0   John   30  honda
1  Sally   54    kia

In [31]:
ddf = dd.read_json("people2.json", orient="split")

In [32]:
ddf.compute()

    name  age    car
0   John   30  honda
1  Sally   54    kia

In [33]:
ddf = dd.read_json("people3.json", lines=True)

In [34]:
ddf.compute()

    name  age    car
0   John   30  honda
1  Sally   54    kia

In [41]:
ddf = dd.read_json("students.json", orient="split")

In [42]:
ddf.compute()

  name  age         scores
0   Li   15   [34, 99, 86]
1   Qu   18  [99, 100, 87]

In [43]:
ddf.dtypes

name      object
age        int64
scores    object
dtype: object

In [47]:
ddf["average_score"] = ddf["scores"].apply(
    lambda x: sum(x) / len(x), meta=("average_score", "float64")
)

In [48]:
ddf.compute()

  name  age         scores  average_score
0   Li   15   [34, 99, 86]      73.000000
1   Qu   18  [99, 100, 87]      95.333333

In [121]:
ddf = dd.read_json("students2.json", orient="split")

In [122]:
ddf["exam_subject"] = ddf.exam.apply(lambda x: x["subject"], meta=("exam_subject", "object"))

In [123]:
ddf.compute()

     name  age                                  exam exam_subject
0  george   16  {'subject': 'geometry', 'score': 56}     geometry
1    nora    7  {'subject': 'geometry', 'score': 87}     geometry

In [125]:
ddf["exam_score"] = ddf.exam.apply(lambda x: x["score"], meta=("exam_score", "int64"))

In [126]:
ddf.compute()

     name  age                                  exam exam_subject  exam_score
0  george   16  {'subject': 'geometry', 'score': 56}     geometry          56
1    nora    7  {'subject': 'geometry', 'score': 87}     geometry          87

In [127]:
ddf = dd.read_json("students3.json", orient="split")

In [142]:
df = pd.read_json("students3.json", orient="split")

In [143]:
df

     name  age                                              exams
0  george   16  [{'subject': 'geometry', 'score': 56}, {'subje...
1    nora    7  [{'subject': 'geometry', 'score': 87}, {'subje...

In [144]:
df["data"]

KeyError: 'data'

In [145]:
pd.json_normalize(df["exams"])

                                      0                                   1
0  {'subject': 'geometry', 'score': 56}  {'subject': 'poetry', 'score': 88}
1  {'subject': 'geometry', 'score': 87}  {'subject': 'poetry', 'score': 94}